mean00/lnArduino/mcus/riscv_ch32v3x/src/lnIRQ_riscv_ch32v3x.cpp
/*
 *  (C) 2022/2023 MEAN00 fixounet@free.fr
 *  See license file
 *  PFIC is configured with 2 nested level, 1 bit for preemption
 *  That means interrupt priority between 0..7 ignoring preemption
 *
 */

#ifdef USE_CH32v3x_HW_IRQ_STACK
#define HANDLER_DESC(x)                                                                                                \
    extern "C" void x();                                                                                               \
    extern "C" void x##_relay() LN_INTERRUPT_TYPE;
#define HANDLER_DESC_C(y)                                                                                              \
    extern "C" void y();                                                                                               \
    extern "C" void y##_relay() LN_INTERRUPT_TYPE;
extern "C" void unsupported_relay();
#define LOCAL_LN_INTERRUPT_TYPE
#define WCH_HW_STACK CH32_SYSCR_HWSTKEN
#else
#define LOCAL_LN_INTERRUPT_TYPE LN_INTERRUPT_TYPE
#define HANDLER_DESC(x) extern "C" void x() LOCAL_LN_INTERRUPT_TYPE;
#define HANDLER_DESC_C(y) extern "C" void y() LOCAL_LN_INTERRUPT_TYPE;
#define WCH_HW_STACK 0
#endif

#include "ch32v3x_interrupt_table.h"
#include "lnArduino.h"
#include "lnIRQ.h"
#include "lnIRQ_riscv_priv_ch32v3x.h"
#include "lnRCU.h"
/**
 *
 */
static void PromoteIrqToFast(const LnIRQ &irq, int no);
void _enableDisable_direct(bool enableDisable, const int &irq_num);
extern "C" void Logger_crash(const char *st);

CH32V3_INTERRUPT *pfic = (CH32V3_INTERRUPT *)LN_PFIC_ADR;

// Attribute [LEVEL1:LEVEL0][SHV] :
//      LEVEL:
//              0:0=LEVEL,
//              0:1=RISING EDGE,
//              1:0: FALLINGEDGE
//      SHV:
//              0 non vectored
//              1 vectored
//

LIST_OF_HANDLERS

#ifdef LN_ENABLE_I2C
void i2cIrqHandler(int instance, bool error);
#else
#define i2cIrqHandler(...) deadEnd(1)
#endif

//--
void LOCAL_LN_INTERRUPT_TYPE I2C0_EV_IRQHandler(void)
{
    i2cIrqHandler(0, false);
}
void LOCAL_LN_INTERRUPT_TYPE I2C0_ERR_IRQHandler(void)
{
    i2cIrqHandler(0, true);
}
void LOCAL_LN_INTERRUPT_TYPE I2C1_EV_IRQHandler(void)
{
    i2cIrqHandler(1, false);
}
void LOCAL_LN_INTERRUPT_TYPE I2C1_ERR_IRQHandler(void)
{
    i2cIrqHandler(1, true);
}

#define FAST_UNUSED 0xFF00
uint16_t fastInterrupt[4] = {FAST_UNUSED, FAST_UNUSED, FAST_UNUSED, FAST_UNUSED};

//---------------------------------------------------------------------
//---------------------------------------------------------------------
/*- Create vector table -*/
#undef INTERRUPT_DESC
#ifdef USE_CH32v3x_HW_IRQ_STACK
#define INTERRUPT_DESC(y) (uint32_t) y##_relay
#else
#define INTERRUPT_DESC(y) (uint32_t) y
#endif
#define UNSUPPORTED_NO(y) (uint32_t) unsupported_##y

static const uint32_t vecTable[] __attribute__((aligned(32))) = {LIST_OF_INTERRUPTS};
#undef INTERRUPT_DESC

//---------------------------------------------------------------------
//---------------------------------------------------------------------

// API used by the freeRTOS port

/**
 * @brief
 *
 */
extern "C" void NVIC_trigger_sw_irq()
{
    const uint32_t sw_irq = 14;
    pfic->IPSR[sw_irq >> 5] = 1 << (sw_irq & 0x1F);
}
/**
 * @brief
 *
 */
extern "C" void NVIC_EnableIRQ(IRQn_Type IRQn)
{
    _enableDisable_direct(true, IRQn);
}

/**
 *
 */
void lnIrqSysInit()
{
    // Disable fast
    for (int i = 0; i < 4; i++)
    {
        pfic->VTFIDR[i] = 0;
        pfic->VTFADDR[i] = 0;
        fastInterrupt[i] = FAST_UNUSED;
    }
// Set all priorities to DEFAULT_PRIO (assuming 2 nested levels)
#define DEFAULT_PRIO 5
    uint32_t prio32 =
        (DEFAULT_PRIO << 4) | (DEFAULT_PRIO << (4 + 8)) | (DEFAULT_PRIO << (4 + 16)) | (DEFAULT_PRIO << (4 + 24));
    for (int i = 0; i < 64; i++)
    {
        pfic->IPRIOIR[i] = prio32;
    }

    // allow fast path for these 2 interrupts
    PromoteIrqToFast(LN_IRQ_SYSTICK, 1);
    PromoteIrqToFast(LN_IRQ_SW, 2);
    // Set these two to higher number = lower priority
    lnIrqSetPriority(LN_IRQ_SYSTICK, 6);
    lnIrqSetPriority(LN_IRQ_SW, 7);

    // relocate vector table
    // Initialise WCH enhance interrutp controller,
    uint32_t syscr = WCH_HW_STACK | CH32_SYSCR_INESTEN | CH32_SYSCR_MPTCFG_2NESTED | CH32_SYSCR_HWSTKOVEN;
    asm volatile("mv t0, %1\n"      // load syscr
                 "csrw 0x804, t0\n" // INTSYSCR : hw stack etc...

                 "li t0, 0x7800\n"
                 "csrs mstatus, t0\n" // Enable floating point and interrupt

                 "mv t0, %0 \n"
                 "ori t0, t0, 3\n"   //      Use vectored mode + relocate vector table
                 "csrw mtvec, t0 \n" //

                 ::"r"(vecTable),
                 "r"(syscr));
}
/**

*/
bool xPortIsInsideInterrupt()
{
    uint32_t gisr = pfic->GISR;
    return (gisr >> 8) & 1; // under interrupt
}

/**
 */
static int lookupIrq(int irq)
{
    if (_irqs[irq].interrpt == irq)
        return _irqs[irq].irqNb;
    // deep search
    int n = sizeof(_irqs) / sizeof(_irqDesc);
    for (int i = 0; i < n; i++)
    {
        if (_irqs[i].interrpt == irq)
            return _irqs[i].irqNb;
    }
    xAssert(0);
    return 0;
}
/**
 */
void _enableDisable_direct(bool enableDisable, const int &irq_num)
{
    if (enableDisable)
    {
        pfic->IENR[irq_num >> 5] = 1 << (irq_num & 0x1f); // 32 bits per register
    }
    else
    {
        pfic->IRER[irq_num >> 5] = 1 << (irq_num & 0x1f);
    }
    // fence ?
}
/**


*/
void _enableDisable(bool enableDisable, const LnIRQ &irq)
{
    int irq_num = lookupIrq(irq); //_irqs[irq].irqNb;
    _enableDisable_direct(enableDisable, irq_num);
}
/**
 * @brief
 *
 * @param irq
 * @param no
 */
void PromoteIrqToFast(const LnIRQ &irq, int no)
{
    if (no < 1 || no > 4)
    {
        xAssert(0);
    }
    no--; // between 0 and 3 now
    int irq_num = lookupIrq(irq);
    uint32_t adr = vecTable[irq_num];
    fastInterrupt[no] = irq;
    pfic->VTFIDR[no] = irq_num;
    pfic->VTFADDR[no] = adr | 1; // fast path enabled by default, bit0
}
/**
 * @brief
 *
 * @param irq
 */
void lnEnableInterrupt(const LnIRQ &irq)
{
    _enableDisable(true, irq);
}
/**
 * @brief
 *
 * @param irq_num
 * @param prio
 */
void lnIrqSetPriority_direct(const int &irq_num, int prio)
{
    int s = (irq_num & 3) * 8;
    int r = irq_num >> 2;
    uint32_t b = pfic->IPRIOIR[r];
    b &= ~(0xff << s);
    b |= (prio << 4) << s;
    pfic->IPRIOIR[r] = b;
}
/**
 * @brief
 *
 * @param irq
 * @param prio
 */
void lnIrqSetPriority(const LnIRQ &irq, int prio)
{
    int irq_num = lookupIrq(irq); //_irqs[irq].irqNb;
    lnIrqSetPriority_direct(irq_num, prio);
}
/**
 * @brief
 *
 * @param irq
 */
void lnDisableInterrupt(const LnIRQ &irq)
{
    _enableDisable(false, irq);
}

void dmaIrqHandler(int dma, int channel);
#define DMA_IRQ(d, c)                                                                                                  \
    void LOCAL_LN_INTERRUPT_TYPE DMA##d##_Channel##c##_IRQHandler(void)                                                \
    {                                                                                                                  \
        dmaIrqHandler(d, c);                                                                                           \
    }

DMA_IRQ(0, 0)
DMA_IRQ(0, 1)
DMA_IRQ(0, 2)
DMA_IRQ(0, 3)
DMA_IRQ(0, 4)
DMA_IRQ(0, 5)
DMA_IRQ(0, 6)
DMA_IRQ(1, 0)
DMA_IRQ(1, 1)
DMA_IRQ(1, 2)
DMA_IRQ(1, 3)
DMA_IRQ(1, 4)
DMA_IRQ(1, 5)
DMA_IRQ(1, 6)
/**
 * @brief
 *
 */

/**
 * @brief
 *
 */
extern "C" void __attribute__((noinline)) deadEnd(int code)
{
    // No interrrupt
    ENTER_CRITICAL();
    Logger_crash("**** CRASH *****");
    Logger_crash("**** CRASH *****");
    Logger_crash("**** CRASH *****");
    __asm__("ebreak");
    while (1)
    {
        // blink red light...
        asm volatile("nop");
    }
}

#define WEAK_INTERRUPT(y)                                                                                              \
    extern "C" void __attribute__((weak)) y()                                                                          \
    {                                                                                                                  \
        xAssert(0);                                                                                                    \
    }

WEAK_INTERRUPT(USB_WAKEUP_IRQHandler)
WEAK_INTERRUPT(USB_TX_IRQHandler)
WEAK_INTERRUPT(USB_RX_IRQHandler)
WEAK_INTERRUPT(USBHS_IRQHandler)
WEAK_INTERRUPT(USART1_IRQHandler)
WEAK_INTERRUPT(USART2_IRQHandler)
WEAK_INTERRUPT(OTG_FS_IRQHandler)

/**
 * @brief
 *
 */
void LN_INTERRUPT_TYPE Break_Point_Handler(void)
{
    deadEnd(5);
}

/**
 * @brief
 *
 */
void lnSoftSystemReset()
{
    volatile uint32_t *pfic_sctlr = (volatile uint32_t *)(LN_PFIC_ADR + 0xd10);
    *pfic_sctlr = (1 << 31);
    while (1)
    {
        __asm__("nop");
    }
}

extern "C"
{

    extern const char _data, _edata;
    extern const char __bss_start, _end;
    extern const char _data_lma;

    int main();
    void __libc_init_array(void);

    /**
     * @brief
     *
     */
    void __attribute__((noreturn)) start_c()
    {

        volatile uint32_t *src = (volatile uint32_t *)&_data_lma;
        volatile uint32_t *dst = (volatile uint32_t *)&_data;
        volatile uint32_t *end = (volatile uint32_t *)&_edata;

        while (dst < end)
        {
            *dst++ = *src++;
        }

        /* Zero .bss. this will corrupt stack & locals on it*/
        volatile uint32_t *zstart = (volatile uint32_t *)&__bss_start;
        volatile uint32_t *zend = (volatile uint32_t *)&_end;
        while (zstart < zend)
        {
            *zstart++ = 0;
        }
        __libc_init_array(); // call ctor before jumping in the code
        main();
        xAssert(0);
    }
}

#define RELAY_FUNC(x)                                                                                                  \
    extern "C" void __attribute__((naked)) x##_relay()                                                                 \
    {                                                                                                                  \
        __asm__("call " #x "\n"                                                                                        \
                "mret");                                                                                               \
    }
#define RELAY_DMA(d, c) RELAY_FUNC(DMA##d##_Channel##c##_IRQHandler)

//---- Relay func
#ifdef USE_CH32v3x_HW_IRQ_STACK
RELAY_FUNC(USART0_IRQHandler)
RELAY_FUNC(USART1_IRQHandler)
RELAY_FUNC(USART2_IRQHandler)
RELAY_FUNC(I2C1_EV_IRQHandler)
RELAY_FUNC(I2C1_ERR_IRQHandler)
RELAY_FUNC(I2C0_EV_IRQHandler)
RELAY_FUNC(I2C0_ERR_IRQHandler)
RELAY_FUNC(Break_Point_Handler)
RELAY_FUNC(SysTick_Handler)
RELAY_FUNC(SW_Handler)
RELAY_FUNC(OTG_FS_IRQHandler)
RELAY_FUNC(USBHS_IRQHandler)
RELAY_FUNC(unsupported)
RELAY_DMA(0, 0)
RELAY_DMA(0, 1)
RELAY_DMA(0, 2)
RELAY_DMA(0, 3)
RELAY_DMA(0, 4)
RELAY_DMA(0, 5)
RELAY_DMA(0, 6)
RELAY_DMA(1, 0)
RELAY_DMA(1, 1)
RELAY_DMA(1, 2)
RELAY_DMA(1, 3)
RELAY_DMA(1, 4)
RELAY_DMA(1, 5)
RELAY_DMA(1, 6)

#endif
// EOF
